of-run/canal/canal3D/canal3DsL/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 0) //0
    (44 0 0)  //1
    (0 7.5 0) //2  
    (44 7.5 0) //3
	(0 32.5 0) //4
	(44 32.5 0) //5
	(0 7.5 7.5) //6
	(44 7.5 7.5) //7
	(220 7.5 7.5) //8   
	(0 32.5 7.5) //9
	(44 32.5 7.5) //10
	(220 32.5 7.5) //11
	(0 7.5 15.5) //12
	(44 7.5 15.5) //13
	(220 7.5 15.5) //14
	(0 32.5 15.5) //15
	(44 32.5 15.5) //16
	(220 32.5 15.5) //17
    (0 0 23) //18
    (44 0 23) //19
	(0 7.5 23) //20
	(44 7.5 23) //21
	(0 32.5 23) //22
	(44 32.5 23) //23
);

blocks
(
    hex (0 1 3 2 18 19 21 20) (35 6 18) simpleGrading (1 1 1)
	hex (2 3 5 4 6 7 10 9) (35 20 6) simpleGrading (1 1 1)     
	hex (6 7 10 9 12 13 16 15) (35 20 6) simpleGrading (1 1 1)
    hex (12 13 16 15 20 21 23 22) (35 20 6) simpleGrading (1 1 1)
	hex (7 8 11 10 13 14 17 16) (141 20 6) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
	leftWall
    {
        type wall;
        faces
        (
            (0 18 20 2)
            (12 20 22 15)
			(6 12 15 9)
			(2 6 9 4)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (11 17 14 8)
			(16 23 21 13)
			(5 10 7 3)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 19 18)
            (1 3 21 19)
            (7 8 14 13)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (4 9 10 5)
            (9 15 16 10)
			(15 22 23 16)
			(10 16 17 11)
        );
    }
	
	frontback
	{
		type wall;
		faces
		(
			(0 1 3 2)
			(2 3 5 4)
			(7 8 11 10)
			(18 19 21 20)
			(20 21 23 22)
			(13 14 17 16)
		);
	}

);

mergePatchPairs
(
);

// ************************************************************************* //
